Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
Refreshing state... [id=agmr-q5k7basu44-iltxhj-GET-200]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-q5k7basu44-2quj81-ANY]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-pharmcat-gnomad]
module.pgxflow[0].aws_api_gateway_integration.submit-patch: Refreshing state... [id=agi-whl80ga3f6-mfqix4-PATCH]
module.pgxflow[0].aws_api_gateway_integration.submit-post: Refreshing state... [id=agi-whl80ga3f6-mfqix4-POST]
module.pgxflow[0].aws_sns_topic_subscription.initFlow: Refreshing state... [id=arn:aws:sns:ap-southeast-3:496940679572:pgxflow-backend-initFlow:8179eb61-425f-4c07-91d4-12e017aee28d]
module.pgxflow[0].aws_lambda_permission.initflow_invoke_permission_api: Refreshing state... [id=AllowAPIInitFlowInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.pgxflow[0].aws_lambda_permission.initflow_invoke_permission_sns: Refreshing state... [id=AllowSNSInitFlowInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-q5k7basu44-8bdpcq-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-q5k7basu44-fh7fed-POST]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-q5k7basu44-annyyp-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-q5k7basu44-8bdpcq-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-q5k7basu44-annyyp-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-q5k7basu44-tfoc5g-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-q5k7basu44-tfoc5g-POST]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-q5k7basu44-x9yetb-POST]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-q5k7basu44-x9yetb-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-q5k7basu44-fh7fed-GET]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-q5k7basu44-5l0now-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-q5k7basu44-93fyd7-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-q5k7basu44-93fyd7-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-q5k7basu44-6cnxhw-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-q5k7basu44-6cnxhw-POST]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-q5k7basu44-5l0now-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-q5k7basu44-b5s2mr-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-q5k7basu44-kzwrfw-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-q5k7basu44-b5s2mr-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-q5k7basu44-a3h38f-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-q5k7basu44-a3h38f-GET]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-q5k7basu44-m7cdum-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-q5k7basu44-e1siuc-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-q5k7basu44-44hcx4-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-q5k7basu44-e1siuc-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-q5k7basu44-1f9qi6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-q5k7basu44-m7cdum-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-q5k7basu44-347vaj-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-q5k7basu44-8staf5-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-q5k7basu44-tbdlai-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-q5k7basu44-347vaj-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-q5k7basu44-tbdlai-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-q5k7basu44-44hcx4-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-q5k7basu44-1f9qi6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-q5k7basu44-8staf5-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-q5k7basu44-mdkzoq-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-q5k7basu44-2ztt52-GET]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-q5k7basu44-2quj81-ANY-200]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-q5k7basu44-v71abw-POST]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-q5k7basu44-cg58h5-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-q5k7basu44-2ztt52-POST]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-q5k7basu44-82hpr9-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-q5k7basu44-82hpr9-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-q5k7basu44-v71abw-GET]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-q5k7basu44-cg58h5-GET]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-q5k7basu44-mdkzoq-GET]
module.pgxflow[0].aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-whl80ga3f6-mfqix4-PATCH-200]
module.pgxflow[0].aws_api_gateway_integration_response.submit-post: Refreshing state... [id=agir-whl80ga3f6-mfqix4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-q5k7basu44-8bdpcq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-q5k7basu44-annyyp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-q5k7basu44-fh7fed-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-q5k7basu44-annyyp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-q5k7basu44-8bdpcq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.info: Refreshing state... [id=agir-q5k7basu44-057wa0-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-q5k7basu44-tfoc5g-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-q5k7basu44-tfoc5g-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-q5k7basu44-x9yetb-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-q5k7basu44-x9yetb-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-q5k7basu44-fh7fed-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-q5k7basu44-5l0now-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-q5k7basu44-93fyd7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-q5k7basu44-93fyd7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-q5k7basu44-6cnxhw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-q5k7basu44-6cnxhw-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-q5k7basu44-5l0now-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-q5k7basu44-b5s2mr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-q5k7basu44-kzwrfw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-q5k7basu44-b5s2mr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-q5k7basu44-a3h38f-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-q5k7basu44-a3h38f-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-q5k7basu44-m7cdum-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-q5k7basu44-44hcx4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-q5k7basu44-e1siuc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-q5k7basu44-1f9qi6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-q5k7basu44-8staf5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-q5k7basu44-e1siuc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-q5k7basu44-m7cdum-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-q5k7basu44-347vaj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-q5k7basu44-tbdlai-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-q5k7basu44-347vaj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-q5k7basu44-1f9qi6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-q5k7basu44-mdkzoq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-q5k7basu44-8staf5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-q5k7basu44-tbdlai-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-q5k7basu44-44hcx4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-q5k7basu44-v71abw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-q5k7basu44-cg58h5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-q5k7basu44-2ztt52-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-q5k7basu44-2ztt52-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-q5k7basu44-cg58h5-GET-200]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-q5k7basu44-v71abw-GET-200]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-q5k7basu44-9gu35e-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-q5k7basu44-cq978v-GET]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-q5k7basu44-ka8qbl-POST]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-q5k7basu44-82hpr9-POST-200]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-q5k7basu44-rtn6ve-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-q5k7basu44-9gu35e-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-q5k7basu44-adicy9-POST]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-q5k7basu44-rtn6ve-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-q5k7basu44-adicy9-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-q5k7basu44-iltxhj-GET]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-q5k7basu44-82hpr9-GET-200]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-q5k7basu44-j8mlzx-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-q5k7basu44-ka8qbl-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-q5k7basu44-iltxhj-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-q5k7basu44-ako1ij-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-q5k7basu44-ako1ij-GET]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-q5k7basu44-j8mlzx-GET]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-lookup: Reading...
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-lookup: Read complete after 0s [id=1377246892]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-postprocessor: Reading...
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-q5k7basu44-mdkzoq-GET-200]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-postprocessor: Read complete after 0s [id=1119299415]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-q5k7basu44-9gu35e-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-q5k7basu44-cq978v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-q5k7basu44-ka8qbl-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-q5k7basu44-9gu35e-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-q5k7basu44-adicy9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-q5k7basu44-rtn6ve-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-q5k7basu44-adicy9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-q5k7basu44-iltxhj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-q5k7basu44-j8mlzx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-q5k7basu44-ka8qbl-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-q5k7basu44-iltxhj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-q5k7basu44-ako1ij-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-q5k7basu44-ako1ij-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-q5k7basu44-j8mlzx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-q5k7basu44-rtn6ve-POST-200]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-lookup:pgxflow-backend-lookup-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-postprocessor:pgxflow-backend-postprocessor-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-lookup]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-postprocessor]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp: Reading...
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp: Read complete after 0s [id=212627211]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-dbsnp:pgxflow-backend-dbsnp-0]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat: Read complete after 0s [id=156379826]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-dbsnp]
module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.dbsnp_invoke_permission: Refreshing state... [id=SNSDbsnpAllowInvoke]
module.pgxflow[0].module.pipeline_lookup.aws_sns_topic_subscription.dbsnp: Refreshing state... [id=arn:aws:sns:ap-southeast-3:496940679572:pgxflow-backend-dbsnp:ebcf53ba-1694-47e6-9e26-b317f35f67ab]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants: Refreshing state... [id=agmr-q5k7basu44-kzwrfw-GET-200]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-q5k7basu44-kzwrfw-GET]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-q5k7basu44-kzwrfw-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post: Refreshing state... [id=agmr-q5k7basu44-cq978v-POST-200]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-q5k7basu44-cq978v-POST]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-q5k7basu44-cq978v-POST-200]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-q5k7basu44-6cnxhw-OPTIONS-200]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.pgxflow[0].archive_file.binaries_layer has changed
  ~ resource "archive_file" "binaries_layer" {
        id                  = "253b1285e9dbab68ea4c32282533b3391c07f149"
      ~ output_base64sha256 = "RMyOSHnaEU78A5obL9Q4Lj8KL23KtH9PG8EzurTjzpU=" -> "iayrHd9pHbQTNGm55p0vW9yn16V1mcpQ9SuNiWKoQYA="
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform planned the following actions, but then encountered a problem:

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10" -> (known after apply)
      ~ code_sha256                 = "RMyOSHnaEU78A5obL9Q4Lj8KL23KtH9PG8EzurTjzpU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T03:25:25.277+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "RMyOSHnaEU78A5obL9Q4Lj8KL23KtH9PG8EzurTjzpU=" -> "iayrHd9pHbQTNGm55p0vW9yn16V1mcpQ9SuNiWKoQYA=" # forces replacement
      ~ source_code_size            = 15214043 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer (deposed object 07f056cb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "binaries_layer" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:9" -> null
      - code_sha256                 = "UPlEf1ifTlbjZtOvO+AcLsEQkiVj2UbMu9epgUodZpE=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:02.654+0000" -> null
      - filename                    = "pgxflow/binaries.zip" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:9" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer" -> null
      - layer_name                  = "pgxflow_backend_binaries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "UPlEf1ifTlbjZtOvO+AcLsEQkiVj2UbMu9epgUodZpE=" -> null
      - source_code_size            = 15168129 -> null
      - version                     = "9" -> null
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:10" -> (known after apply)
      ~ code_sha256                 = "Vtrrnmg0QXvRXAUkF3oyLg4q+IkwKd5GKC9t4ZMboR0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T03:25:23.404+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "VvD2o/S9HVlJB6ypLlkTUWhDeit+STUKCzcAyrc3nfcPFo149JkQnQ9zI7cuQOngxMNXplgnOaD8Yllt5sCG8g==" -> "3nUKNo1Co3kBhX4ga06ZdQt/L3PU9WW2IcdzIF7kzmRLgj22lwb0xlOuExPrsFAcAWIQ+gThwINW1FO+v+mH9Q==" # forces replacement
      ~ source_code_size            = 18449787 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer (deposed object 32863fdb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "binaries_layer" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:9" -> null
      - code_sha256                 = "S/HQYoHaM+SF2TiF82dzkuhDMs6mEOkapkr6R2ntYGw=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:06.790+0000" -> null
      - filename                    = "sbeacon/binaries.zip" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:9" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer" -> null
      - layer_name                  = "sbeacon_backend_binaries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "cbGF3X1+aIrSjKdnfwACjNPI/gMMcIPdysqHrEb5+C1aGfmujfQxhSnkaEQNCuLWY0mBMmtJug6dRZQTwCPZ1g==" -> null
      - source_code_size            = 18422741 -> null
      - version                     = "9" -> null
        # (4 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      + content                       = "v1.1.0-58-g8d6bc741+"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8090698806267908525" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131817713000" -> "1758694988347644000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (deposed object 64f29155) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1869639089258103147" -> null
      - triggers = {
          - "filename"  = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip"
          - "timestamp" = "1756361685240473000"
        } -> null
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1921115277418996752" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131625663000" -> "1758694988143389000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4614014654433147496" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130280167200" -> "1758694988281828000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (deposed object cfbfbb0b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1337235770744722143" -> null
      - triggers = {
          - "filename"  = "builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip"
          - "timestamp" = "1756361685449994000"
        } -> null
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1391104642598508959" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684131666210000" -> "1758694988494423000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (deposed object 0617627c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2260548409954944835" -> null
      - triggers = {
          - "filename"  = "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip"
          - "timestamp" = "1756361684846930000"
        } -> null
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8458098319246234530" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130729964000" -> "1758694988753071000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5123127738704869804" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684145092609000" -> "1758694994167821000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1022349097466289853" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684145186575800" -> "1758694993264669800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (deposed object d5480857) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5664222191838405854" -> null
      - triggers = {
          - "filename"  = "builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip"
          - "timestamp" = "1756361700666369000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7241504912307692269" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684144668930000" -> "1758694997439548000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (deposed object 98059a6b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5353161973208422263" -> null
      - triggers = {
          - "filename"  = "builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip"
          - "timestamp" = "1756361700748755000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-initFlow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7655499047729469076" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684145290721800" -> "1758694993974955000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (deposed object 43c8627c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4236660406947051515" -> null
      - triggers = {
          - "filename"  = "builds/08e9ac66aa91b1fa215c5f717ba16651bdffb481e2e36bdfac525a6b1f984e99.zip"
          - "timestamp" = "1756361700912474000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8703729787473236019" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684144994484000" -> "1758694999819937000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (deposed object 1fd6a44e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3286309420736970208" -> null
      - triggers = {
          - "filename"  = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
          - "timestamp" = "1756361700584431000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3993318811367844970" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684145245510200" -> "1758694992975950000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (deposed object 9b4ca7e8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7198756868642591030" -> null
      - triggers = {
          - "filename"  = "builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip"
          - "timestamp" = "1756361700831021000"
        } -> null
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:9" -> (known after apply)
      ~ code_sha256                 = "+rXNUI4nOynpx5o4zdkyVDyt5DVSAO2EB7bEDlnv6Fc=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T03:25:31.422+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:9" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/fd9acdc95a283fe18aa3161a165c1ae4ce1d8d365a604fb37c724c436d26883a.zip" -> "builds/9ff3a36ee97c5a268529d392bc9458a2651a8b1e1b0f5990bc7214bc0e5d6293.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172631 -> (known after apply)
      ~ version                     = "9" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object 42fa75f9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:8" -> null
      - code_sha256                 = "hGFoK/sZkISwlelpr0SoAWyd14aAYhNgEmnYwLEZYAI=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:05.687+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:8" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer" -> null
      - layer_name                  = "pgxflow_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "pgxflow-backend-layers-20250804065614849900000001" -> null
      - s3_key                      = "builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 172659 -> null
      - version                     = "8" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250804065614849900000001/builds/fd9acdc95a283fe18aa3161a165c1ae4ce1d8d365a604fb37c724c436d26883a.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "a92241ad832196039e617ffa3335acbf" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250804065614849900000001/builds/fd9acdc95a283fe18aa3161a165c1ae4ce1d8d365a604fb37c724c436d26883a.zip" -> (known after apply)
      ~ key                           = "builds/fd9acdc95a283fe18aa3161a165c1ae4ce1d8d365a604fb37c724c436d26883a.zip" -> "builds/9ff3a36ee97c5a268529d392bc9458a2651a8b1e1b0f5990bc7214bc0e5d6293.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/fd9acdc95a283fe18aa3161a165c1ae4ce1d8d365a604fb37c724c436d26883a.zip" -> "builds/9ff3a36ee97c5a268529d392bc9458a2651a8b1e1b0f5990bc7214bc0e5d6293.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object f4806ee6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250804065614849900000001/builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - bucket                        = "pgxflow-backend-layers-20250804065614849900000001" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "315870bfba17e17aaa1d67dba2a71df5" -> null
      - force_destroy                 = false -> null
      - id                            = "pgxflow-backend-layers-20250804065614849900000001/builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - key                           = "builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/9ff3a36ee97c5a268529d392bc9458a2651a8b1e1b0f5990bc7214bc0e5d6293.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9ff3a36ee97c5a268529d392bc9458a2651a8b1e1b0f5990bc7214bc0e5d6293.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "320827587787665746" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/fd9acdc95a283fe18aa3161a165c1ae4ce1d8d365a604fb37c724c436d26883a.zip" -> "builds/9ff3a36ee97c5a268529d392bc9458a2651a8b1e1b0f5990bc7214bc0e5d6293.zip"
          ~ "timestamp" = "1758684147177483000" -> "1758695004195942000"
        }
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] (deposed object dea6b6c2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7298861572116236696" -> null
      - triggers = {
          - "filename"  = "builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip"
          - "timestamp" = "1756361703728175000"
        } -> null
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14" -> (known after apply)
      ~ code_sha256                 = "t3LgqIoYZ30Njgv8s+HZl7Jt5JPHaTVVgdg6M8k6T0c=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T03:25:27.372+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/8d219de61ba852185795c002b5698d56a7b76fe39b8e3b22b4a100d933ce5f8e.zip" -> "builds/ca7fb096162e871aa2ec606c86160d913c02139f3c5224e9756b673f817261bc.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22792 -> (known after apply)
      ~ version                     = "14" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object beee8480) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:13" -> null
      - code_sha256                 = "Zlw8g0TL4Qd9IVwI/zyKASLJAJprg6Og3O3xPKjxZDo=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:07.675+0000" -> null
      - description                 = "python modules" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:13" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer" -> null
      - layer_name                  = "pgxflow_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "pgxflow-backend-layers-20250804065614849900000001" -> null
      - s3_key                      = "builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 22801 -> null
      - version                     = "13" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250804065614849900000001/builds/8d219de61ba852185795c002b5698d56a7b76fe39b8e3b22b4a100d933ce5f8e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "ff0dbcb29aee8e673cc9a64094f722b8" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250804065614849900000001/builds/8d219de61ba852185795c002b5698d56a7b76fe39b8e3b22b4a100d933ce5f8e.zip" -> (known after apply)
      ~ key                           = "builds/8d219de61ba852185795c002b5698d56a7b76fe39b8e3b22b4a100d933ce5f8e.zip" -> "builds/ca7fb096162e871aa2ec606c86160d913c02139f3c5224e9756b673f817261bc.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/8d219de61ba852185795c002b5698d56a7b76fe39b8e3b22b4a100d933ce5f8e.zip" -> "builds/ca7fb096162e871aa2ec606c86160d913c02139f3c5224e9756b673f817261bc.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 399539c2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250804065614849900000001/builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - bucket                        = "pgxflow-backend-layers-20250804065614849900000001" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "4c7e06f92c1d424a6c9defc572c613c0" -> null
      - force_destroy                 = false -> null
      - id                            = "pgxflow-backend-layers-20250804065614849900000001/builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - key                           = "builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ca7fb096162e871aa2ec606c86160d913c02139f3c5224e9756b673f817261bc.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ca7fb096162e871aa2ec606c86160d913c02139f3c5224e9756b673f817261bc.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2044571137764985417" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8d219de61ba852185795c002b5698d56a7b76fe39b8e3b22b4a100d933ce5f8e.zip" -> "builds/ca7fb096162e871aa2ec606c86160d913c02139f3c5224e9756b673f817261bc.zip"
          ~ "timestamp" = "1758684144585680000" -> "1758694994061515000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] (deposed object 5ffc3743) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5573612915150012264" -> null
      - triggers = {
          - "filename"  = "builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip"
          - "timestamp" = "1756361701167171000"
        } -> null
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/d861b638c81e86468e3f0dbc3ce97d987f334af42da43ca82324ecc371fbbbdf.zip" -> "builds/476c92d02b6dfb0b14315450ea4582290127f65eb9060f6a831a5808d381f95c.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-24T04:24:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/476c92d02b6dfb0b14315450ea4582290127f65eb9060f6a831a5808d381f95c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/476c92d02b6dfb0b14315450ea4582290127f65eb9060f6a831a5808d381f95c.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5573652770031523516" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d861b638c81e86468e3f0dbc3ce97d987f334af42da43ca82324ecc371fbbbdf.zip" -> "builds/476c92d02b6dfb0b14315450ea4582290127f65eb9060f6a831a5808d381f95c.zip"
          ~ "timestamp" = "1758684131037446000" -> "1758694988769563000"
        }
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] (deposed object 56f93d0e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "703595700007032358" -> null
      - triggers = {
          - "filename"  = "builds/e512dd16edc68920cc6daac38137f79e349e1367e65e9bf380b1c5b4b6f32299.zip"
          - "timestamp" = "1756361685339948800"
        } -> null
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/6eacf9acdf0889d247b7511f6e69fef6e1c2148c8f9bf69b6adbc38256cdf9da.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known aft
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.